{"author":{"name":"Artem Ivashko","type":"card","url":"https://tyomaiva.github.io"},"children":[{"content":{"html":"\u003cdiv id=\"fb-root\"\u003e\u003c/div\u003e\n\u003cscript async defer crossorigin=\"anonymous\" src=\"https://connect.facebook.net/en_US/sdk.js#xfbml=1\u0026version=v8.0\" nonce=\"DkNGMnnm\"\u003e\u003c/script\u003e\n\u003ch2 id=\"мотивация-и-предыстория\"\u003eМотивация и предыстория\u003c/h2\u003e\n\u003cp\u003eЛет около 20 назад я начал учиться в классе замечательного учителя математики, \u003ca href=\"https://ru.wikipedia.org/wiki/%D0%AF%D0%BA%D0%B8%D1%80,%5F%D0%9C%D0%B8%D1%85%D0%B0%D0%B8%D0%BB%5F%D0%A1%D0%B5%D0%BC%D1%91%D0%BD%D0%BE%D0%B2%D0%B8%D1%87\"\u003eМихаила Семёновича Якира\u003c/a\u003e. И вот я случайно наткнулся на его канал в Youtube под названием \u003ca href=\"https://www.youtube.com/channel/UCMNZdL8EWKoHHMxzcMiFR%5FA\"\u003e\u0026ldquo;Математика. По страницам учебников Мерзляка и Ко\u0026rdquo;\u003c/a\u003e, который Михаил Семёнович (далее сокращенно М. С.) начал вести совсем недавно.\u003c/p\u003e\n\u003cp\u003eЕсли честно, вышеупомянутый канал, как выход М. С. в медиа-пространство, был для меня неожиданностью. Но видимо, это тот случай, когда молчать нельзя. Дело в том, что мой учитель вышел на пенсию несколько лет назад, и в силу обстоятельств преподавать в школе не может. Тем более вся эта ситуация с вирусом. А поделиться \u0026ldquo;вживую\u0026rdquo; есть чем: 40 лет педагогического опыта на дороге не валяются. И вот, в качестве отклика на появление канала, я спонтанно решил подготовить тот текст, что Вы видите сейчас перед глазами. Я никогда раньше не вёл блога, а привык общаться лично, так что этот жанр для меня новый. Но просто добавить комментарии к каким-то из видеороликов было бы явно недостаточно, в то время как завести блог в 2020 году вроде так же легко, как сходить в супермаркет за продуктами. (Правда, на деле всё оказалось несколько сложнее, да и мы не ищем лёгких путей, но не суть важно.)\u003c/p\u003e\n\u003cp\u003eКак ни странно, первый вопрос, который встал перед написанием настоящей заметки, был о языке. С одной стороны, со своими домочадцами я разговариваю виключно українською мовою (ні, не думайте, що це зумовлено модою або політичною ситуацією, так було заведено в нас вже останні 10 років). С другой стороны, с окружением я разговариваю в основном на английском (вперемешку с ломаным голландским). С третьей стороны, я вырос в русскоязычной семье. Но поскольку сам М. С. общается по-русски, в том числе на своём канале, я решил избрать последний вариант. Надеюсь, это решение не оттолкнёт потенциальных читателей блога и зрителей канала. Для меня язык \u0026ndash; это средство для соединения, а не повод для разделения.\u003c/p\u003e\n\u003cp\u003eДля контекста, скажу несколько слов о личном школьном пути. Последние четыре класса (с 8 по 11) я учился в киевском лицее со скромным названием \u0026ldquo;\u003ca href=\"https://uk.wikipedia.org/wiki/%D0%9A%D0%B8%D1%94%D0%B2%D0%BE-%D0%9F%D0%B5%D1%87%D0%B5%D1%80%D1%81%D1%8C%D0%BA%D0%B8%D0%B9%5F%D0%BB%D1%96%D1%86%D0%B5%D0%B9%5F%E2%84%96%5F171%5F%C2%AB%D0%9B%D1%96%D0%B4%D0%B5%D1%80%C2%BB\"\u003eЛидер\u003c/a\u003e\u0026rdquo;, в классе с углублённым изучением математики (\u0026ldquo;матклассе\u0026rdquo;). Я считаю этот лицей одним из лучших мест по \u003cem\u003eвсей\u003c/em\u003e Украине для обучения математике вообще и подготовки к математическим соревнованиям (\u0026ldquo;олимпиадам\u0026rdquo;) в частности. (Так было в моё время, по крайней мере. Да, я осознаю эффект жабы хвалящей своё болото, но при необходимости могу предоставить объективные метрики.) Так сложилось благодаря многолетнему упорному труду М. С. и его коллег \u003ca href=\"https://www.litres.ru/vitaliy-polonskiy/ob-avtore/\"\u003eВиталия Борисовича Полонского\u003c/a\u003e и Аркадия Григорьевича Мерзляка (впрочем, о последнем я знаю скорее понаслышке, непосредственного контакта с ним я не имел). Что интересно, по слухам, некоторые из выпускников лидеровского маткласса сами пошли по преподавательской стезе и впоследствии начали составлять серьёзную конкуренцию самому М. С. в плане подготовке олимпиадников. Что не может не служить неявным комплиментом их alma mater.\u003c/p\u003e\n\u003ch2 id=\"чему-нас-учили--и-зачем\"\u003eЧему нас учили (и зачем?)\u003c/h2\u003e\n\u003cp\u003eА точнее \u0026ndash; что нам старались привить? Попробую описать несколько примеров, без излишней ностальгии.\u003c/p\u003e\n\u003cp\u003eПервое \u0026ndash; это \u0026ldquo;математическая культура\u0026rdquo;. Чтобы понять, о чём идёт речь, настоятельно рекомендую просмотреть видео \u003ca href=\"https://www.youtube.com/watch?v=di%5Fiuy1heJY\"\u003e\u0026ldquo;90% учащихся решают эти задачи НЕПРАВИЛЬНО\u0026rdquo;\u003c/a\u003e перед тем, как читать дальше. По-моему, М. С. ни в этом ролике, ни в других, не использует термина \u0026ldquo;математическая культура\u0026rdquo;, хотя в школе он орудовал им постоянно. По сути, под этим термином подразумевается умение решить задачу до конца, не упуская деталей или каких-то частных случаев. Очевидно, что без этого навыка занятия математикой вырождаются в следование какой-то квазинауке, где большинство утверждений до конца не доказаны, а значит и потенциально неверны.\u003c/p\u003e\n\u003cp\u003eНо какой тогда толк от такой культуры в реальной взрослой жизни? Не проявление ли это какой-то нездоровой дотошности и перфекционизма? По своему опыту скажу, что на практике в физике утверждения часто не доказываются математически строго. Там намного важнее предоставить \u003cem\u003eубедительную\u003c/em\u003e цепочку рассуждений, впрочем, подкрепляемую математическими выкладками. (И поверьте, математики там полно, причём на любой вкус.) Куда уж тут до культуры?\u003c/p\u003e\n\u003cp\u003eПо-моему, суть культуры заключается не в математической строгости как таковой, а в навыке целостного анализа ситуации и выявлении потенциальных \u0026ldquo;краевых случаев\u0026rdquo; (edge cases). Например, производится какая-то операция, которая в краевом случае вообще не определена, и такой сценарий сразу детектируется в уме. Часто выявление краевого случая и вывод о его важности делается очень быстро, почти подсознательно, и в случае неважности даже не проговаривается, тем не менее такой процесс \u003cem\u003eкрайне\u003c/em\u003e важен. Предупреждён \u0026ndash; значит вооружён. Возьмём пример из программирования \u0026ndash; \u003ca href=\"https://en.wikipedia.org/wiki/Buffer%5Foverflow\"\u003ebuffer overflow\u003c/a\u003e, когда в массив фиксированного размера добавляются и убираются элементы, но не учитывается случай, когда добавить новый элемент уже некуда. И честный компьютер добавляет этот элемент в ту область памяти, где содержится уже другой объект. Ба-бах! Как ни банально звучит этот сценарий, он до сих пор очень \u0026ldquo;популярен\u0026rdquo; в программных продуктах и в прошлом дал почву для злоупотреблений хакерами. Одной из причин того, что такие вещи \u0026ldquo;проходят\u0026rdquo;, является трудноуловимость такого сценария при тестировании, и если даже программист его упустил, шансы велики, что разработчик тестов последует его примеру. Вывод \u0026ndash; такие случаи нужно продумывать в голове сразу, ещё на стадии написания кода.\u003c/p\u003e\n\u003cp\u003eВторое \u0026ndash; понятие о математической красоте. Опять для иллюстрации приведу видео с того же канала: \u003ca href=\"https://www.youtube.com/watch?v=m4jH%5FVcjoEM\"\u003e\u0026ldquo;Что такое Красивая задача, или когда на плоскости места мало\u0026rdquo;.\u003c/a\u003e Но постойте, какая может быть красота в \u003cem\u003eматематике\u003c/em\u003e? Не является ли это очередным злоупотреблением общего понятия? Ведь красота бывает в живописи, в музыке, и вообще само слово попахивает метафизикой. Что интересно, после многолетних рассуждений я сам не могу дать удовлетворительное определение красоты. Но вот какое интересное определение даёт М. С. в этом ролике:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eКрасивая задача = Простота + Неожиданность.\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003eНеожиданность решения задачи. Простота как решения, так и самой постановки задачи. Для иллюстрации этой \u0026ldquo;формулы\u0026rdquo; М. С. приводит задачу, решение которой меня просто потрясло. (Михаил Семёнович, почему Вы нам её не давали?! Или я тогда болел?:-) Опять-таки, всем советую просмотреть видеоролик.\u003c/p\u003e\n\u003cp\u003eСо своей стороны приведу пример красивой задачи, которая запомнилась со школьной скамьи:\u003c/p\u003e\n\u003cblockquote\u003e\n\u003cp\u003eCуществует ли равносторонний треугольник с вершинами в узлах плоской квадратной сетки?\u003c/p\u003e\n\u003c/blockquote\u003e\n\u003cp\u003e(То есть, представьте себе листочек тетрадки в клеточку, только бесконечный в обоих измерениях, и Вы можете выбирать любые три точки в углах квадратиков.) Согласитесь, формулировка \u0026ndash; чрезвычайно простая. Решений, наверное, существует несколько, но то, которое мне известно \u0026ndash; и элегантное, и неожиданное. Впрочем, не буду его здесь выкладывать, попробуйте подступиться к нему сами. Если не выйдет, мы что-то придумаем в комментариях. Кроме того, заметьте, что в этой задаче присутствует азарт \u0026ndash; ведь ответа на поставленный вопрос может быть два (\u0026ldquo;да\u0026rdquo; и \u0026ldquo;нет\u0026rdquo;), и для начала решения нужно выбрать один из них в качестве гипотезы, но какой?\u003c/p\u003e\n\u003cp\u003eВ \u0026ldquo;нестандартных\u0026rdquo; задачах (М. С. использует именно такой термин, а не \u0026ldquo;олимпиадные\u0026rdquo; задачи) подобной красоты \u0026ndash; полно. Можно даже сказать, что неожиданность \u0026ndash; \u003cem\u003eнепременный атрибут\u003c/em\u003e нестандартной задачи (иначе она превращается в обыкновенную). Таких задач мы решали много, и в школе, и за её пределами. Добрая четверть класса ими жила (без фанатизма, впрочем). М. С. регулярно готовил нам так называемые \u0026ldquo;задавальники\u0026rdquo; \u0026ndash; блоки по 5-10 задач, которые можно было решать в течение нескольких недель. Тот факт, что они формулировались просто, позволял их легко запоминать и решать где угодно \u0026ndash; в классе, дома на диване, в автобусе, в дýше, или даже на ходу. Что интересно, те задавальники до сих пор хранятся у меня дома в Киеве. Вообще, я старался сохранить задачи со \u003cem\u003eвсех\u003c/em\u003e соревнований, в которых я учавствовал, по математике так точно. Если новое поколение учащихся/учителей в этом заинтересовано, обращайтесь, что-нибудь придумаем.\u003c/p\u003e\n\u003cp\u003eХочу заметить, что иногда такие нестандартные задачи получается всё-таки решить стандартным подходом, методом грубой силы. Решение тогда часто выходит очень громоздким, скучным, не прослеживается какая-то особенная идея решения (метод ведь стандартный). Как следствие, в ходе формальных преобразований решающий может вполне пропустить ошибку (например, упустить частный случай), в порыве выдать желаемое за действительное. Такие случаи М. С. характеризовал выражением \u0026ldquo;убить задачу\u0026rdquo;. Например, не искать решение геометрической задачи, требующей всего нескольких дополнительных построений, а решить её в лоб методом координат на четыре-пять страниц выкладок, и то, упуская детали. (Представьте себе лицо человека, проверяющего такую задачу.) Другой способ \u0026ldquo;убить задачу\u0026rdquo; \u0026ndash; применить \u0026ldquo;запрещённые\u0026rdquo; методы, выходящие за рамки школьной программы. Помню, как М. С. возмущался, когда услышал о решении одной задачи на олимпиаде с помощью приближения синуса несколькими первыми членами его ряда Тейлора. Если цель \u0026ndash; это просто уметь решать задачи любой ценой, то ладно. Но наш учитель смотрел дальше. Позже я и сам убедился, что забегание вперёд часто ни к чему хорошему не приводит.\u003c/p\u003e\n\u003cp\u003eКроме технических навыков и углубления знаний, я думаю, что мы приобрели \u0026ldquo;вкус\u0026rdquo;, как некий побочный эффект от решения красивых задач. Как и красота, вкус тяжело поддаётся определению, тем не менее он объективно существует. Вкус, позволяющий выбрать адекватный подход к решению задачи, и отсеять неадекватный. Вкус к самому выбору задач.\u003c/p\u003e\n\u003cp\u003eОпять выйдем за школьные рамки. Зачем нам искать простоту и зачем тут какой-то вкус? Возьмём инженерию, понимаемую в широком смысле, как построение систем прямой практической ценности из большого количества заранее хорошо изученных ингредиентов. Так вот, в дальновидной инженерии давно признано, что чем проще дизайн, тем лучше. Почему? Эстетика мало интересует большинство инженеров, и тем более руководителей проектов и заказчиков. Но как ни банально, чем меньше частей, тем меньше причин поломки или непредсказуемого поведения системы. Тем легче удерживать в голове всю систему и анализировать взаимодействие её частей. Тем качественнее полученный продукт. (Кому интересно, смотрите \u003ca href=\"https://en.wikipedia.org/wiki/KISS%5Fprinciple\"\u003eпринцип KISS\u003c/a\u003e, а в применении к программированию \u0026ndash; \u003ca href=\"https://www.infoq.com/presentations/Simple-Made-Easy/\"\u003eSimple Made Easy\u003c/a\u003e.)\u003c/p\u003e\n\u003cp\u003eЧто касается выбора задач, мне лично время от времени попадаются \u0026ldquo;извращённые\u0026rdquo; задачи, или такие задачи, где кто-то давно уже выбрал за меня метод решения (а времени перекроить уже просто нет), или где другие части системы не дают свободы. Что же, в таком случае нужно просто решать задачу, а вкус временно отключить. Но там, где пути решения открыты (чаще всего, это касается новых проектов), вкус играет неоценимую роль путеводителя.\u003c/p\u003e\n\u003ch2 id=\"заключение\"\u003eЗаключение\u003c/h2\u003e\n\u003cp\u003eЯ очень признателен Михаилу Семёновичу за все усилия, которые он вложил для того, чтобы помочь мне полюбить математику и научиться мыслить за рамками привычного, в частности, решать нестандартные математические задачи. При том, что я не показывал особенных результатов, в отличие от других одноклассников, например, \u003ca href=\"https://imo-official.org/participant%5Fr.aspx?id=7940\"\u003eВаси Кузнецова\u003c/a\u003e, \u003ca href=\"https://imo-official.org/participant%5Fr.aspx?id=8434\"\u003eСаши Кравца\u003c/a\u003e, \u003ca href=\"https://stats.ioinformatics.org/people/2601\"\u003eЮры Зновьяка\u003c/a\u003e, \u003ca href=\"https://stats.ioinformatics.org/people/552\"\u003eДанила Мысака\u003c/a\u003e, и некоторых других. Оглядываясь назад, нельзя не признаться, что настолько интенсивного периода в своей жизни, в плане реального и глубокого освоения новых навыков, у меня уже больше никогда не было.\u003c/p\u003e\n\u003cp\u003eНе хочу пренебречь другими учителями, которые сыграли важную роль в моём школьном образовании. Просто акцент в данной заметке не на них. Тем не менее, хочу особо отметить \u003ca href=\"http://filippovsky.com/about\"\u003eГригория Борисовича Филипповского\u003c/a\u003e, \u003ca href=\"https://www.rl.kiev.ua/news/pitannya-nashi-vidpovidi-vashi-irina-volodimirivna-mihajlik-13628/\"\u003eИрину Владимировну Михайлик\u003c/a\u003e и Александра Исааковича Апостолова. Кто знает, может в будущем я ещё напишу о них\u0026hellip;\u003c/p\u003e\n\u003cp\u003eНо при всём при этом хочется отметить, что я \u003cem\u003eне\u003c/em\u003e во всём согласен с М. С. Например, не я не разделяю его взгляда на роль математики в жизни его подопечных после окончания школы. В нашем классе была явная нацеленность на профессиональную математическую карьеру тех из выпускников, что проявляли определённые успехи. Тот факт, что я в последних двух классах решил пойти учиться на физика, огорчило М.С. (не знаю, правда, насколько сильно), ведь физика считалась предметом второсортным по сравнению с математикой. При этом, никакого отторжения или дискриминации я тогда на себе не почувствовал, в целом царила атмосфера свободы. Впрочем, я давно не имел подходящей возможности поговорить с М. С., а позиции людей могут меняться со временем. И для полноты картины, приведу одно из высказываний М. С., направленное к нам, ученикам: \u0026ldquo;Можете ставать потом кем угодно, хоть рецидивистом, но только профессионалом\u0026rdquo;. Такую крайность я тоже не разделяю, да и сказана она была видимо для подчёркивания акцента, а не всерьёз.\u003c/p\u003e\n\u003cp\u003eВ качестве заключения скажу, что школьная математика является идеальным полигоном для развития аналитических способностей, абстрактного, логического и критического аспектов мышления. Математические задачи обладают уникальным свойством: их можно полностью и строго решить, без привнесения дополнительных (произвольных или оправданных) предположений о структуре оперируемых объектов. (Я не касаюсь сейчас таких тонких вещей, как неполная строгость в доказательстве теорем евклидовой геометрии исходя из одних лишь 5 аксиом. Давайте не в этот раз. По-моему, уход в такие дебри всё равно ничего нового не даёт, а любопытные могут пролистать, например, \u003ca href=\"https://math.ru/lib/files/pdf/shen/shen-rigor.pdf\"\u003e\u0026ldquo;О математической строгости и школьном курсе математики\u0026rdquo;\u003c/a\u003e.) Хотя устойчивый навык решения нестандартных задач требует неимоверного вложения времени и сил, при правильном подходе и подборе задач, при подходящем окружении единомышленников это делать чрезвычайно увлекательно. Игра стоит свеч, а плоды пожинаются потом всю жизнь, начиная уже с университетской скамьи. При этом, преувеличивать роль математики в полноценном развитии подростка не стоит, это даже чревато опасностями.\u003c/p\u003e\n\u003cp\u003eМного ещё чем хочется поделиться касательно роли математики за пределами самóй чистой математики. В частности, парадоксальным выводом о том, что математика \u0026ndash; самая \u003cem\u003eпростая\u003c/em\u003e из наук (имею в виду тот объём, который входит в школьную и университетскую программу), хотя может быть и самая \u003cem\u003eтрудная\u003c/em\u003e в освоении. (Да-да, \u0026ldquo;простой\u0026rdquo; и \u0026ldquo;лёгкий\u0026rdquo; не являются синонимами, смотрите видео, которое я упоминал выше, \u003ca href=\"https://www.infoq.com/presentations/Simple-Made-Easy/\"\u003eSimple Made Easy\u003c/a\u003e.) Есть ещё мысли о том, каким является оптимальный карьерный путь среднестатистического выпускника хорошего маткласса, и как необходимо перестроить программу технического образования в соответствии с этим. Это результаты размышлений, которые меня занимали и в период аспирантуры по теоретической физике, и в последние годы, когда я ушёл в мир программирования, цифровой электроники и прикладных математических алгоритмов.\u003c/p\u003e\n\u003cp\u003eК читателям: если какие-то из поднятых вопросов Вас заинтересовали и хочется более подробного обсуждения, пишите в комментариях ниже, возможно я напишу ещё несколько постов. И хотелось бы услышать мнения моих одноклассников и других людей, которые (были) увлечены школьной математикой. Особенно ценно мнение, отличное от моего, только прошу, конструктивное.\u003c/p\u003e\n\u003cdiv class=\"fb-comments\" data-href=\"https://tyomaiva.github.io/posts/yakir/\" data-numposts=\"7\" data-width=\"\"\u003e\u003c/div\u003e\n","text":"  Мотивация и предыстория Лет около 20 назад я начал учиться в классе замечательного учителя математики, Михаила Семёновича Якира. И вот я случайно наткнулся на его канал в Youtube под названием \u0026ldquo;Математика. По страницам учебников Мерзляка и Ко\u0026rdquo;, который Михаил Семёнович (далее сокращенно М. С.) начал вести совсем недавно.\nЕсли честно, вышеупомянутый канал, как выход М. С. в медиа-пространство, был для меня неожиданностью. Но видимо, это тот случай, когда молчать нельзя. Дело в том, что мой учитель вышел на пенсию несколько лет назад, и в силу обстоятельств преподавать в школе не может. Тем более вся эта ситуация с вирусом. А поделиться \u0026ldquo;вживую\u0026rdquo; есть чем: 40 лет педагогического опыта на дороге не валяются. И вот, в качестве отклика на появление канала, я спонтанно решил подготовить тот текст, что Вы видите сейчас перед глазами. Я никогда раньше не вёл блога, а привык общаться лично, так что этот жанр для меня новый. Но просто добавить комментарии к каким-то из видеороликов было бы явно недостаточно, в то время как завести блог в 2020 году вроде так же легко, как сходить в супермаркет за продуктами. (Правда, на деле всё оказалось несколько сложнее, да и мы не ищем лёгких путей, но не суть важно.)\nКак ни странно, первый вопрос, который встал перед написанием настоящей заметки, был о языке. С одной стороны, со своими домочадцами я разговариваю виключно українською мовою (ні, не думайте, що це зумовлено модою або політичною ситуацією, так було заведено в нас вже останні 10 років). С другой стороны, с окружением я разговариваю в основном на английском (вперемешку с ломаным голландским). С третьей стороны, я вырос в русскоязычной семье. Но поскольку сам М. С. общается по-русски, в том числе на своём канале, я решил избрать последний вариант. Надеюсь, это решение не оттолкнёт потенциальных читателей блога и зрителей канала. Для меня язык \u0026ndash; это средство для соединения, а не повод для разделения.\nДля контекста, скажу несколько слов о личном школьном пути. Последние четыре класса (с 8 по 11) я учился в киевском лицее со скромным названием \u0026ldquo;Лидер\u0026rdquo;, в классе с углублённым изучением математики (\u0026ldquo;матклассе\u0026rdquo;). Я считаю этот лицей одним из лучших мест по всей Украине для обучения математике вообще и подготовки к математическим соревнованиям (\u0026ldquo;олимпиадам\u0026rdquo;) в частности. (Так было в моё время, по крайней мере. Да, я осознаю эффект жабы хвалящей своё болото, но при необходимости могу предоставить объективные метрики.) Так сложилось благодаря многолетнему упорному труду М. С. и его коллег Виталия Борисовича Полонского и Аркадия Григорьевича Мерзляка (впрочем, о последнем я знаю скорее понаслышке, непосредственного контакта с ним я не имел). Что интересно, по слухам, некоторые из выпускников лидеровского маткласса сами пошли по преподавательской стезе и впоследствии начали составлять серьёзную конкуренцию самому М. С. в плане подготовке олимпиадников. Что не может не служить неявным комплиментом их alma mater.\nЧему нас учили (и зачем?) А точнее \u0026ndash; что нам старались привить? Попробую описать несколько примеров, без излишней ностальгии.\nПервое \u0026ndash; это \u0026ldquo;математическая культура\u0026rdquo;. Чтобы понять, о чём идёт речь, настоятельно рекомендую просмотреть видео \u0026ldquo;90% учащихся решают эти задачи НЕПРАВИЛЬНО\u0026rdquo; перед тем, как читать дальше. По-моему, М. С. ни в этом ролике, ни в других, не использует термина \u0026ldquo;математическая культура\u0026rdquo;, хотя в школе он орудовал им постоянно. По сути, под этим термином подразумевается умение решить задачу до конца, не упуская деталей или каких-то частных случаев. Очевидно, что без этого навыка занятия математикой вырождаются в следование какой-то квазинауке, где большинство утверждений до конца не доказаны, а значит и потенциально неверны.\nНо какой тогда толк от такой культуры в реальной взрослой жизни? Не проявление ли это какой-то нездоровой дотошности и перфекционизма? По своему опыту скажу, что на практике в физике утверждения часто не доказываются математически строго. Там намного важнее предоставить убедительную цепочку рассуждений, впрочем, подкрепляемую математическими выкладками. (И поверьте, математики там полно, причём на любой вкус.) Куда уж тут до культуры?\nПо-моему, суть культуры заключается не в математической строгости как таковой, а в навыке целостного анализа ситуации и выявлении потенциальных \u0026ldquo;краевых случаев\u0026rdquo; (edge cases). Например, производится какая-то операция, которая в краевом случае вообще не определена, и такой сценарий сразу детектируется в уме. Часто выявление краевого случая и вывод о его важности делается очень быстро, почти подсознательно, и в случае неважности даже не проговаривается, тем не менее такой процесс крайне важен. Предупреждён \u0026ndash; значит вооружён. Возьмём пример из программирования \u0026ndash; buffer overflow, когда в массив фиксированного размера добавляются и убираются элементы, но не учитывается случай, когда добавить новый элемент уже некуда. И честный компьютер добавляет этот элемент в ту область памяти, где содержится уже другой объект. Ба-бах! Как ни банально звучит этот сценарий, он до сих пор очень \u0026ldquo;популярен\u0026rdquo; в программных продуктах и в прошлом дал почву для злоупотреблений хакерами. Одной из причин того, что такие вещи \u0026ldquo;проходят\u0026rdquo;, является трудноуловимость такого сценария при тестировании, и если даже программист его упустил, шансы велики, что разработчик тестов последует его примеру. Вывод \u0026ndash; такие случаи нужно продумывать в голове сразу, ещё на стадии написания кода.\nВторое \u0026ndash; понятие о математической красоте. Опять для иллюстрации приведу видео с того же канала: \u0026ldquo;Что такое Красивая задача, или когда на плоскости места мало\u0026rdquo;. Но постойте, какая может быть красота в математике? Не является ли это очередным злоупотреблением общего понятия? Ведь красота бывает в живописи, в музыке, и вообще само слово попахивает метафизикой. Что интересно, после многолетних рассуждений я сам не могу дать удовлетворительное определение красоты. Но вот какое интересное определение даёт М. С. в этом ролике:\n Красивая задача = Простота + Неожиданность.\n Неожиданность решения задачи. Простота как решения, так и самой постановки задачи. Для иллюстрации этой \u0026ldquo;формулы\u0026rdquo; М. С. приводит задачу, решение которой меня просто потрясло. (Михаил Семёнович, почему Вы нам её не давали?! Или я тогда болел?:-) Опять-таки, всем советую просмотреть видеоролик.\nСо своей стороны приведу пример красивой задачи, которая запомнилась со школьной скамьи:\n Cуществует ли равносторонний треугольник с вершинами в узлах плоской квадратной сетки?\n (То есть, представьте себе листочек тетрадки в клеточку, только бесконечный в обоих измерениях, и Вы можете выбирать любые три точки в углах квадратиков.) Согласитесь, формулировка \u0026ndash; чрезвычайно простая. Решений, наверное, существует несколько, но то, которое мне известно \u0026ndash; и элегантное, и неожиданное. Впрочем, не буду его здесь выкладывать, попробуйте подступиться к нему сами. Если не выйдет, мы что-то придумаем в комментариях. Кроме того, заметьте, что в этой задаче присутствует азарт \u0026ndash; ведь ответа на поставленный вопрос может быть два (\u0026ldquo;да\u0026rdquo; и \u0026ldquo;нет\u0026rdquo;), и для начала решения нужно выбрать один из них в качестве гипотезы, но какой?\nВ \u0026ldquo;нестандартных\u0026rdquo; задачах (М. С. использует именно такой термин, а не \u0026ldquo;олимпиадные\u0026rdquo; задачи) подобной красоты \u0026ndash; полно. Можно даже сказать, что неожиданность \u0026ndash; непременный атрибут нестандартной задачи (иначе она превращается в обыкновенную). Таких задач мы решали много, и в школе, и за её пределами. Добрая четверть класса ими жила (без фанатизма, впрочем). М. С. регулярно готовил нам так называемые \u0026ldquo;задавальники\u0026rdquo; \u0026ndash; блоки по 5-10 задач, которые можно было решать в течение нескольких недель. Тот факт, что они формулировались просто, позволял их легко запоминать и решать где угодно \u0026ndash; в классе, дома на диване, в автобусе, в дýше, или даже на ходу. Что интересно, те задавальники до сих пор хранятся у меня дома в Киеве. Вообще, я старался сохранить задачи со всех соревнований, в которых я учавствовал, по математике так точно. Если новое поколение учащихся/учителей в этом заинтересовано, обращайтесь, что-нибудь придумаем.\nХочу заметить, что иногда такие нестандартные задачи получается всё-таки решить стандартным подходом, методом грубой силы. Решение тогда часто выходит очень громоздким, скучным, не прослеживается какая-то особенная идея решения (метод ведь стандартный). Как следствие, в ходе формальных преобразований решающий может вполне пропустить ошибку (например, упустить частный случай), в порыве выдать желаемое за действительное. Такие случаи М. С. характеризовал выражением \u0026ldquo;убить задачу\u0026rdquo;. Например, не искать решение геометрической задачи, требующей всего нескольких дополнительных построений, а решить её в лоб методом координат на четыре-пять страниц выкладок, и то, упуская детали. (Представьте себе лицо человека, проверяющего такую задачу.) Другой способ \u0026ldquo;убить задачу\u0026rdquo; \u0026ndash; применить \u0026ldquo;запрещённые\u0026rdquo; методы, выходящие за рамки школьной программы. Помню, как М. С. возмущался, когда услышал о решении одной задачи на олимпиаде с помощью приближения синуса несколькими первыми членами его ряда Тейлора. Если цель \u0026ndash; это просто уметь решать задачи любой ценой, то ладно. Но наш учитель смотрел дальше. Позже я и сам убедился, что забегание вперёд часто ни к чему хорошему не приводит.\nКроме технических навыков и углубления знаний, я думаю, что мы приобрели \u0026ldquo;вкус\u0026rdquo;, как некий побочный эффект от решения красивых задач. Как и красота, вкус тяжело поддаётся определению, тем не менее он объективно существует. Вкус, позволяющий выбрать адекватный подход к решению задачи, и отсеять неадекватный. Вкус к самому выбору задач.\nОпять выйдем за школьные рамки. Зачем нам искать простоту и зачем тут какой-то вкус? Возьмём инженерию, понимаемую в широком смысле, как построение систем прямой практической ценности из большого количества заранее хорошо изученных ингредиентов. Так вот, в дальновидной инженерии давно признано, что чем проще дизайн, тем лучше. Почему? Эстетика мало интересует большинство инженеров, и тем более руководителей проектов и заказчиков. Но как ни банально, чем меньше частей, тем меньше причин поломки или непредсказуемого поведения системы. Тем легче удерживать в голове всю систему и анализировать взаимодействие её частей. Тем качественнее полученный продукт. (Кому интересно, смотрите принцип KISS, а в применении к программированию \u0026ndash; Simple Made Easy.)\nЧто касается выбора задач, мне лично время от времени попадаются \u0026ldquo;извращённые\u0026rdquo; задачи, или такие задачи, где кто-то давно уже выбрал за меня метод решения (а времени перекроить уже просто нет), или где другие части системы не дают свободы. Что же, в таком случае нужно просто решать задачу, а вкус временно отключить. Но там, где пути решения открыты (чаще всего, это касается новых проектов), вкус играет неоценимую роль путеводителя.\nЗаключение Я очень признателен Михаилу Семёновичу за все усилия, которые он вложил для того, чтобы помочь мне полюбить математику и научиться мыслить за рамками привычного, в частности, решать нестандартные математические задачи. При том, что я не показывал особенных результатов, в отличие от других одноклассников, например, Васи Кузнецова, Саши Кравца, Юры Зновьяка, Данила Мысака, и некоторых других. Оглядываясь назад, нельзя не признаться, что настолько интенсивного периода в своей жизни, в плане реального и глубокого освоения новых навыков, у меня уже больше никогда не было.\nНе хочу пренебречь другими учителями, которые сыграли важную роль в моём школьном образовании. Просто акцент в данной заметке не на них. Тем не менее, хочу особо отметить Григория Борисовича Филипповского, Ирину Владимировну Михайлик и Александра Исааковича Апостолова. Кто знает, может в будущем я ещё напишу о них\u0026hellip;\nНо при всём при этом хочется отметить, что я не во всём согласен с М. С. Например, не я не разделяю его взгляда на роль математики в жизни его подопечных после окончания школы. В нашем классе была явная нацеленность на профессиональную математическую карьеру тех из выпускников, что проявляли определённые успехи. Тот факт, что я в последних двух классах решил пойти учиться на физика, огорчило М.С. (не знаю, правда, насколько сильно), ведь физика считалась предметом второсортным по сравнению с математикой. При этом, никакого отторжения или дискриминации я тогда на себе не почувствовал, в целом царила атмосфера свободы. Впрочем, я давно не имел подходящей возможности поговорить с М. С., а позиции людей могут меняться со временем. И для полноты картины, приведу одно из высказываний М. С., направленное к нам, ученикам: \u0026ldquo;Можете ставать потом кем угодно, хоть рецидивистом, но только профессионалом\u0026rdquo;. Такую крайность я тоже не разделяю, да и сказана она была видимо для подчёркивания акцента, а не всерьёз.\nВ качестве заключения скажу, что школьная математика является идеальным полигоном для развития аналитических способностей, абстрактного, логического и критического аспектов мышления. Математические задачи обладают уникальным свойством: их можно полностью и строго решить, без привнесения дополнительных (произвольных или оправданных) предположений о структуре оперируемых объектов. (Я не касаюсь сейчас таких тонких вещей, как неполная строгость в доказательстве теорем евклидовой геометрии исходя из одних лишь 5 аксиом. Давайте не в этот раз. По-моему, уход в такие дебри всё равно ничего нового не даёт, а любопытные могут пролистать, например, \u0026ldquo;О математической строгости и школьном курсе математики\u0026rdquo;.) Хотя устойчивый навык решения нестандартных задач требует неимоверного вложения времени и сил, при правильном подходе и подборе задач, при подходящем окружении единомышленников это делать чрезвычайно увлекательно. Игра стоит свеч, а плоды пожинаются потом всю жизнь, начиная уже с университетской скамьи. При этом, преувеличивать роль математики в полноценном развитии подростка не стоит, это даже чревато опасностями.\nМного ещё чем хочется поделиться касательно роли математики за пределами самóй чистой математики. В частности, парадоксальным выводом о том, что математика \u0026ndash; самая простая из наук (имею в виду тот объём, который входит в школьную и университетскую программу), хотя может быть и самая трудная в освоении. (Да-да, \u0026ldquo;простой\u0026rdquo; и \u0026ldquo;лёгкий\u0026rdquo; не являются синонимами, смотрите видео, которое я упоминал выше, Simple Made Easy.) Есть ещё мысли о том, каким является оптимальный карьерный путь среднестатистического выпускника хорошего маткласса, и как необходимо перестроить программу технического образования в соответствии с этим. Это результаты размышлений, которые меня занимали и в период аспирантуры по теоретической физике, и в последние годы, когда я ушёл в мир программирования, цифровой электроники и прикладных математических алгоритмов.\nК читателям: если какие-то из поднятых вопросов Вас заинтересовали и хочется более подробного обсуждения, пишите в комментариях ниже, возможно я напишу ещё несколько постов. И хотелось бы услышать мнения моих одноклассников и других людей, которые (были) увлечены школьной математикой. Особенно ценно мнение, отличное от моего, только прошу, конструктивное.\n "},"name":"Михаил Семёнович Якир: по страницам учебников Мерзляка и Ко","published":"2020-10-14T16:46:00+02:00","summary":"или \u0026ldquo;Математика vs. реальная жизнь после окончания школы\u0026rdquo;","type":"entry","url":"https://tyomaiva.github.io/posts/yakir/"}],"name":"Posts","type":"feed","url":"https://tyomaiva.github.io/posts/"}